app/controllers/charges_controller.rb

	def create
		@amount = params[:amount].to_i

		invoice_id = params[:invoice].to_i
		@invoice = Invoice.find_by_id(invoice_id)
		@invoice[:date_paid] = Time.now.in_time_zone("Eastern Time (US & Canada)")
		@invoice.save
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = 5 LIMIT 1
UPDATE "invoices" SET "date_paid" = ?, "updated_at" = ? WHERE "invoices"."id" = 5  [["date_paid", 2013-09-10 23:00:23 -0400], ["updated_at", Wed, 11 Sep 2013 03:00:23 UTC +00:00]]