app/controllers/clients_controller.rb

INSERT INTO "clients" ("created_at", "email", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Sep 2013 19:40:31 UTC +00:00], ["email", "katie@katiedunn.com"], ["name", "Katie Dunn"], ["updated_at", Sat, 07 Sep 2013 19:40:31 UTC +00:00], ["user_id", 2]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_client
      @client = Client.friendly.find(params[:id])