app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.where(:user_id => current_user.id)
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."user_id" = 3 LIMIT 1

  def create
    @user = current_user
    @clients = @user.clients
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save
---
INSERT INTO "invoices" ("amount", "client_id", "created_at", "date_due", "date_paid", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @invoice.update(invoice_params)
---
UPDATE "invoices" SET "date_paid" = ?, "updated_at" = ? WHERE "invoices"."id" = 3  [["date_paid", ""], ["updated_at", Wed, 11 Sep 2013 21:56:57 EDT -04:00]]

  def send_to_client
    @user = current_user
    @invoice = Invoice.find_by_id(params[:invoice_id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = 1 LIMIT 1

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", "2"]]