app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Sep 2013 20:00:37 UTC +00:00], ["email", "mr.lake@gmail.com"], ["name", "Chris Lake"], ["updated_at", Tue, 03 Sep 2013 20:00:37 UTC +00:00]]

    def set_user
      @user = User.friendly.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]